/*
 다음의 형태로 표현된 2차원 배열이 있다.
 
 (1) (2) (3)
  4   5   6
  7   8   9
  
  이렇게 전달되면 다음의 형태로 구조를 변경하는 메소드를 정의해보자.
  
  7   8   9
 (1) (2) (3)
  4   5   6
  
  즉, 메소드를 호출하면 1행은 2행으로, 2행은 3행으로, 3행은 1행으로 이동하게 된다.
  세로길이에 상관없이 동작하도록 메소드를 정의해야 한다.
  
 */


package ex06array;

public class QuTwoDimLotate {

	static void main(String[] args) {

	/*
	 절차]
	  1. 배열의 마지막행을 1차원 배열 변수에 임시로 저장한다.
	  2. 배열의 2행을 3행으로, 1행을 2행으로 옮긴다.
	  3. 1번에서 임시로 저장했던 값을 1행으로 옮긴다.
	  
	  ※ 2차원배열에서 "배열이름[인덱스]"가 하나의 행(세로행)을
	  	가리킨다는 것을 활용하는 문제이다.
	 */
		
		
		
		
		
		
	}

}
